XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-L_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>SAM-L_DFP</name>
  <description>Microchip SAM L Series Device Support and Examples</description>

  <releases>
    <release version="1.2.2" date="2020-10-21" deprecated="2020-10-21">
      This pack is going to be deprecated. Device Support is maintained by Microchip going forward.
      Updated MDK Examples have been moved to respective board support packs (BSP) from Keil.
      Please remove this pack and install one of the following pairs of packs:
      - Microchip.SAML21_DFP.3.4.82.atpack and Keil.SAML21_BSP.1.0.0
      - Microchip.SAML22_DFP.3.4.61.atpack and Keil.SAML22_BSP.1.0.0
    </release>
    <release version="1.2.1" date="2018-05-15">
      Updated device vendor from Atmel to Microchip.
    </release>
    <release version="1.2.0" date="2015-08-28">
      Added SAM L21*B device support.
      Added SAM L22*A device support.
    </release>
    <release version="1.1.0" date="2015-05-05">
      Updated device support files.
      Added device features.
      Added SAML21-XPRO board support and example.
      Updated description, family and sub-family names to SAM L
    </release>
    <release version="1.0.0" date="2015-02-06">
      First Release version of Atmel SAM L Series Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Microchip</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Microchip</keyword>
    <keyword>SAM L</keyword>
  </keywords>

  <devices>
    <family Dfamily="SAM L Series" Dvendor="Microchip:3">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book name="Documents\DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <!--book name="http://www.atmel.com/products/microcontrollers/arm/sam-l.aspx" title="SAM L Documents"/-->
      <description>
The Microchip | SMART SAM L family of microcontrollers (MCUs) delivers power consumption down to 35 uA/MHz in active mode and 200nA in Sleep mode.
In addition to ultra-low-power performance, these new devices feature Full Speed USB host and device, Event System and Sleepwalking, 12-bit analog, AES, capacitive touch sensing, built in opAmps and much more.
With the Internet of Things (IoT) market predicted to grow to billion devices by 2020, designers increasingly need lower-power MCUs that will enable these applications—without adding load to utility grids or requiring frequent battery changes.
The new ultra-low-power Microchip | SMART platform is specifically designed to power these applications, expanding battery life from years to decades.
      </description>

      <!-- ************************  Subfamily 'SAM L21'  **************************** -->
      <subFamily DsubFamily="SAM L21">
        <processor Dclock="48000000"/>
        <compile header="Device\SAML21\Include\saml21.h"/>

        <book name="Documents\Atmel-42385-SAM-L21_Datasheet.pdf" title="SAM L21 Datasheet"/>
        <description>
A rich set of peripherals, flexibility and ease-of-use combined with Ultra low power consumption make the Microchip ǀ SMART SAM L21 ARM Cortex-M0+ based microcontroller series ideal for IoT, wireless, and any system that needs large memories and ultra-low power consumption.
The SAM L21 is designed for simple and intuitive migration between SAM L devices with identical peripheral modules, compatible code and a linear address map and is compatible with the SAM D family of general-purpose MCUs.
        </description>

        <feature type="CoreOther"     n="12"                      name="Event System channels"/>
        <feature type="DMA"           n="16"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="WDT"           n="1"/>
        <feature type="Timer"         n="3"       m="32"          name="Timer/Counter for Control"/>
        <feature type="AnalogOther"   n="2"                       name="Analog Comparator"/>
        <feature type="ComOther"      n="1"                       name="USB Embedded Host and Device mode"/>
        <feature type="Crypto"        n="128.256"                 name="Advanced Encryption Standard"/>
        <feature type="RNG"           n="1"                       name="True Random Number Generator"/>
        <feature type="Other"         n="1"                       name="Operational Amplifier"/>
        <feature type="DAC"           n="2"       m="10"/>
        <feature type="RTC"           n="32768"/>
        <feature type="TempSens"      n="1"/>
        <feature type="Touch"         n="1"                       name="Peripheral Touch Controller"/>
        <feature type="VCC"           n="1.63"    m="3.63"/>
        <feature type="Temp"          n="-40"     m="85"/>

        <!-- ******************************  ATSAML21E15A  ****************************** -->
        <device Dname="ATSAML21E15A">
          <compile define="__SAML21E15A__"/>
          <debug svd="SVD\SAML21\ATSAML21E15A.svd"/>
          <memory     id="IROM1"                          start="0x00000000" size="0x08000" startup="1" default="1"/>
          <memory     id="IRAM1"                          start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <memory     id="IRAM2"                          start="0x30000000" size="0x00800" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_32.FLM"         start="0x00000000" size="0x08000"             default="1"/>
          <algorithm name="Flash\ATSAML21_32_EEPROM.FLM"  start="0x00400000" size="0x00400"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="25"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21E15B  ****************************** -->
        <device Dname="ATSAML21E15B">
          <compile define="__SAML21E15B__"/>
          <debug svd="SVD\SAML21\ATSAML21E15B.svd"/>
          <memory     id="IROM1"                          start="0x00000000" size="0x08000" startup="1" default="1"/>
          <memory     id="IRAM1"                          start="0x20000000" size="0x01000" init   ="0" default="1"/>
          <memory     id="IRAM2"                          start="0x30000000" size="0x00800" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_32.FLM"         start="0x00000000" size="0x08000"             default="1"/>
          <algorithm name="Flash\ATSAML21_32_EEPROM.FLM"  start="0x00400000" size="0x00400"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="25"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

