XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-L_DFP.pdsc
        <!-- ******************************  ATSAML21E16A  ****************************** -->
        <device Dname="ATSAML21E16A">
          <compile define="__SAML21E16A__"/>
          <debug svd="SVD\SAML21\ATSAML21E16A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x01000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash\ATSAML21_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="25"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21E16B  ****************************** -->
        <device Dname="ATSAML21E16B">
          <compile define="__SAML21E16B__"/>
          <debug svd="SVD\SAML21\ATSAML21E16B.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x01000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash\ATSAML21_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="25"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21E17A  ****************************** -->
        <device Dname="ATSAML21E17A">
          <compile define="__SAML21E17A__"/>
          <debug svd="SVD\SAML21\ATSAML21E17A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash\ATSAML21_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="25"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21E17B  ****************************** -->
        <device Dname="ATSAML21E17B">
          <compile define="__SAML21E17B__"/>
          <debug svd="SVD\SAML21\ATSAML21E17B.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash\ATSAML21_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="25"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21E18B  ****************************** -->
        <device Dname="ATSAML21E18B">
          <compile define="__SAML21E18B__"/>
          <debug svd="SVD\SAML21\ATSAML21E18B.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash\ATSAML21_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="4"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="10"      m="12"/>
          <feature type="IOs"           n="25"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="32"                      name="QFN Package"/>
          <feature type="QFP"           n="32"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21G16A  ****************************** -->
        <device Dname="ATSAML21G16A">
          <compile define="__SAML21G16A__"/>
          <debug svd="SVD\SAML21\ATSAML21G16A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x01000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash\ATSAML21_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21G16B  ****************************** -->
        <device Dname="ATSAML21G16B">
          <compile define="__SAML21G16B__"/>
          <debug svd="SVD\SAML21\ATSAML21G16B.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x01000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash\ATSAML21_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21G17A  ****************************** -->
        <device Dname="ATSAML21G17A">
          <compile define="__SAML21G17A__"/>
          <debug svd="SVD\SAML21\ATSAML21G17A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash\ATSAML21_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21G17B  ****************************** -->
        <device Dname="ATSAML21G17B">
          <compile define="__SAML21G17B__"/>
          <debug svd="SVD\SAML21\ATSAML21G17B.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash\ATSAML21_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21G18A  ****************************** -->
        <device Dname="ATSAML21G18A">
          <compile define="__SAML21G18A__"/>
          <debug svd="SVD\SAML21\ATSAML21G18A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash\ATSAML21_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21G18B  ****************************** -->
        <device Dname="ATSAML21G18B">
          <compile define="__SAML21G18B__"/>
          <debug svd="SVD\SAML21\ATSAML21G18B.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash\ATSAML21_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

