XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-L_DFP.pdsc
        <!-- ******************************  ATSAML21J16A  ****************************** -->
        <device Dname="ATSAML21J16A">
          <compile define="__SAML21J16A__"/>
          <debug svd="SVD\SAML21\ATSAML21J16A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x01000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash\ATSAML21_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21J16B  ****************************** -->
        <device Dname="ATSAML21J16B">
          <compile define="__SAML21J16B__"/>
          <debug svd="SVD\SAML21\ATSAML21J16B.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x01000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash\ATSAML21_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21J17A  ****************************** -->
        <device Dname="ATSAML21J17A">
          <compile define="__SAML21J17A__"/>
          <debug svd="SVD\SAML21\ATSAML21J17A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash\ATSAML21_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21J17B  ****************************** -->
        <device Dname="ATSAML21J17B">
          <compile define="__SAML21J17B__"/>
          <debug svd="SVD\SAML21\ATSAML21J17B.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash\ATSAML21_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML21J18A  ****************************** -->
        <device Dname="ATSAML21J18A">
          <compile define="__SAML21J18A__"/>
          <debug svd="SVD\SAML21\ATSAML21J18A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash\ATSAML21_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

