XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-L_DFP.pdsc
        <!-- ******************************  ATSAML21J18B  ****************************** -->
        <device Dname="ATSAML21J18B">
          <compile define="__SAML21J18B__"/>
          <debug svd="SVD\SAML21\ATSAML21J18B.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <memory    id="IRAM2"                           start="0x30000000" size="0x02000" init   ="0" default="0"/>
          <algorithm name="Flash\ATSAML21_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash\ATSAML21_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'SAM L22'  **************************** -->
      <subFamily DsubFamily="SAM L22">
        <processor Dclock="32000000"/>
        <compile header="Device\SAML22\Include\saml22.h"/>

        <book name="Documents\Atmel-42402-SAM-L22_Datasheet.pdf" title="SAM L22 Datasheet"/>
        <description>
The Microchip ǀ SMART SAM L22 ARM Cortex-M0+ based microcontroller series are ideal for IoT, HMI, Building Automation, smart metering, wireless, and any system that needs segment LCD controller, large memories and ultra-low power consumption.
With a rich set of peripherals, flexibility and ease-of-use combined with ultra-low power consumption, the SAM L22 is designed for simple and intuitive migration between SAM L devices due to identical peripheral modules, compatible code and a linear address map.
The SAM L22 is also compatible with the SAM D family of general-purpose MCUs.
        </description>

        <feature type="CoreOther"     n="12"                      name="Event System channels"/>
        <feature type="DMA"           n="16"/>
        <feature type="ExtInt"        n="16"/>
        <feature type="WDT"           n="1"/>
        <feature type="Timer"         n="3"       m="32"          name="Timer/Counter for Control"/>
        <feature type="AnalogOther"   n="2"                       name="Analog Comparator"/>
        <feature type="ComOther"      n="1"                       name="USB Embedded Host and Device mode"/>
        <feature type="Crypto"        n="128.256"                 name="Advanced Encryption Standard"/>
        <feature type="RNG"           n="1"                       name="True Random Number Generator"/>
        <feature type="Other"         n="1"                       name="Operational Amplifier"/>
        <feature type="DAC"           n="2"       m="10"/>
        <feature type="RTC"           n="32768"/>
        <feature type="TempSens"      n="1"/>
        <feature type="Touch"         n="1"                       name="Peripheral Touch Controller"/>
        <feature type="VCC"           n="1.63"    m="3.63"/>
        <feature type="Temp"          n="-40"     m="85"/>

        <!-- ******************************  ATSAML22G16A  ****************************** -->
        <device Dname="ATSAML22G16A">
          <compile define="__SAML22G16A__"/>
          <debug svd="SVD\SAML22\ATSAML22G16A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAML22_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash\ATSAML22_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML22G17A  ****************************** -->
        <device Dname="ATSAML22G17A">
          <compile define="__SAML22G17A__"/>
          <debug svd="SVD\SAML22\ATSAML22G17A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAML22_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash\ATSAML22_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML22G18A  ****************************** -->
        <device Dname="ATSAML22G18A">
          <compile define="__SAML22G18A__"/>
          <debug svd="SVD\SAML22\ATSAML22G18A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAML22_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash\ATSAML22_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="Timer"         n="3"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="48"                      name="QFN Package"/>
          <feature type="QFP"           n="48"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML22J16A  ****************************** -->
        <device Dname="ATSAML22J16A">
          <compile define="__SAML22J16A__"/>
          <debug svd="SVD\SAML22\ATSAML22J16A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAML22_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash\ATSAML22_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

