XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-L_DFP.pdsc
        <!-- ******************************  ATSAML22J17A  ****************************** -->
        <device Dname="ATSAML22J17A">
          <compile define="__SAML22J17A__"/>
          <debug svd="SVD\SAML22\ATSAML22J17A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAML22_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash\ATSAML22_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML22J18A  ****************************** -->
        <device Dname="ATSAML22J18A">
          <compile define="__SAML22J18A__"/>
          <debug svd="SVD\SAML22\ATSAML22J18A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAML22_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash\ATSAML22_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML22N16A  ****************************** -->
        <device Dname="ATSAML22N16A">
          <compile define="__SAML22N16A__"/>
          <debug svd="SVD\SAML22\ATSAML22N16A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x10000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x02000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAML22_64.FLM"         start="0x00000000" size="0x10000"             default="1"/>
          <algorithm name="Flash\ATSAML22_64_EEPROM.FLM"  start="0x00400000" size="0x00800"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML22N17A  ****************************** -->
        <device Dname="ATSAML22N17A">
          <compile define="__SAML22N17A__"/>
          <debug svd="SVD\SAML22\ATSAML22N17A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x20000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x04000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAML22_128.FLM"        start="0x00000000" size="0x20000"             default="1"/>
          <algorithm name="Flash\ATSAML22_128_EEPROM.FLM" start="0x00400000" size="0x01000"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>

        <!-- ******************************  ATSAML22J18A  ****************************** -->
        <device Dname="ATSAML22N18A">
          <compile define="__SAML22N18A__"/>
          <debug svd="SVD\SAML22\ATSAML22N18A.svd"/>
          <memory    id="IROM1"                           start="0x00000000" size="0x40000" startup="1" default="1"/>
          <memory    id="IRAM1"                           start="0x20000000" size="0x08000" init   ="0" default="1"/>
          <algorithm name="Flash\ATSAML22_256.FLM"        start="0x00000000" size="0x40000"             default="1"/>
          <algorithm name="Flash\ATSAML22_256_EEPROM.FLM" start="0x00400000" size="0x02000"             default="1"/>

          <feature type="Timer"         n="5"       m="32"          name="Timer/Counter"/>
          <feature type="ComOther"      n="6"                       name="SERCOMM (i2C, USART, SPI)"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"                      name="General Purpose I/Os"/>
          <feature type="QFN"           n="64"                      name="QFN Package"/>
          <feature type="QFP"           n="64"                      name="TQFP Package"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="SAML21">
      <description>Microchip SAM L21 devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAML21*"/>
    </condition>
    <condition id="SAML22">
      <description>Microchip SAM L22 devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAML22*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="SAML21 CMSIS">
      <description>Microchip SAM L21 devices and CMSIS Core</description>
      <require condition="SAML21"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="SAML22 CMSIS">
      <description>Microchip SAM L22 devices and CMSIS Core</description>
      <require condition="SAML22"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
