XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAM-L_DFP.pdsc
  </conditions>

  <components>
    <!-- Startup SAML21 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SAML21 CMSIS">
      <description>System Startup for Microchip SAM L21 devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\SAML21\Include\"/>
        <!-- startup / system file -->
        <file category="source" name="Device\SAML21\Source\ARM\startup_SAML21.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\SAML21\Source\system_saml21.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup SAML22 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SAML22 CMSIS">
      <description>System Startup for Microchip SAM L22 devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\SAML22\Include\"/>
        <!-- startup / system file -->
        <file category="source" name="Device\SAML22\Source\ARM\startup_SAML22.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\SAML22\Source\system_saml22.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- SAML21-XPRO Board Support -->
    <bundle Cbundle="SAML21-XPRO" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAML21-XPRO Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="SAML21 CMSIS">
      <description>LED driver for Microchip SAML21-XPRO Board</description>
        <files>
          <file category="source" name="Boards\Atmel\SAML21-XPRO\Common\LED_SAML21-XPRO.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="SAML21 CMSIS">
      <description>Button driver for Microchip SAML21-XPRO Board</description>
        <files>
          <file category="source" name="Boards\Atmel\SAML21-XPRO\Common\Buttons_SAML21-XPRO.c"/>
        </files>
      </component>
    </bundle>

    <!-- SAML22-XPRO Board Support -->
    <bundle Cbundle="SAML22-XPRO" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAML22-XPRO Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="SAML22 CMSIS">
      <description>LED driver for Microchip SAML22-XPRO Board</description>
        <files>
          <file category="source" name="Boards\Atmel\SAML22-XPRO\Common\LED_SAML22-XPRO.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="SAML22 CMSIS">
      <description>Button driver for Microchip SAML22-XPRO Board</description>
        <files>
          <file category="source" name="Boards\Atmel\SAML22-XPRO\Common\Buttons_SAML22-XPRO.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <board vendor="Microchip" name="SAML21-XPRO" revision="Rev. A" salesContact="http://www.atmel.com/about/contact/distributors/default.aspx" orderForm="http://store.atmel.com/">
      <description>SAM L21 Xplained Pro Evaluation Kit</description>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAML21J18A"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" DsubFamily="SAM L21"/>
      <book category="overview"  name="http://www.atmel.com/tools/ATSAML21-XPRO.aspx"  title="SAM L21 Xplained Pro Evaluation Kit"/>
      <book category="manual"    name="Boards\Atmel\SAML21-XPRO\Documents\Atmel-42405-SAML21-Xplained-Pro_User-Guide.pdf" title="User Manual"/>

      <feature type="XTAL"            n="32768"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="Batt"            n="1"              name="Backup battery"/>
      <feature type="LED"             n="3"              name="Power, Status, User LED"/>
      <feature type="Button"          n="2"              name="Reset, user button"/>
      <feature type="Touch"           n="1"              name="QTouch button"/>
      <feature type="USB"             n="1"              name="USB interface, device and host mode"/>
      <feature type="ConnOther"       n="3"              name="Xplained Pro extension header"/>
	  <feature type="ODbg"            n="1"              name="Onboard Embedded Debugger"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>

    <board vendor="Microchip" name="SAML22-XPRO" revision="Rev. A" salesContact="http://www.atmel.com/about/contact/distributors/default.aspx" orderForm="http://store.atmel.com/">
      <description>SAM L22 Xplained Pro Evaluation Kit</description>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAML22N18A"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" DsubFamily="SAM L22"/>
      <book category="overview"  name="http://www.atmel.com/tools/ATSAML22-XPRO.aspx"  title="SAM L22 Xplained Pro Evaluation Kit"/>
      <book category="manual"    name="Boards\Atmel\SAML22-XPRO\Documents\Atmel-42474-SAM-L22-Xplained-Pro_User-Guide.pdf" title="User Manual"/>

      <feature type="XTAL"            n="32768"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="LED"             n="3"              name="Power, Status, User LED"/>
      <feature type="Button"          n="2"              name="Reset, user button"/>
      <feature type="Touch"           n="1"              name="QTouch button"/>
      <feature type="USB"             n="1"              name="USB interface, device and host mode"/>
      <feature type="ConnOther"       n="3"              name="Xplained Pro extension header"/>
	  <feature type="ODbg"            n="1"              name="Onboard Embedded Debugger"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- SAML21-XPRO Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Atmel\SAML21-XPRO\Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SAML21-XPRO" vendor="Microchip"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- SAML22-XPRO Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Atmel\SAML22-XPRO\Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SAML22-XPRO" vendor="Microchip"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
